## Plan Result (test_apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
        name                              = "cft-apim00-perftest-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/cft-mtls-api-mgmt-appgw-address-pool" -> null
          - backend_address_pool_name   = "cft-mtls-api-mgmt-appgw-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw-http-settings" -> null
          - backend_http_settings_name  = "cft-mtls-api-mgmt-appgw-http-settings" -> null
          - http_listener_id            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - http_listener_name          = "cft-mtls-api-mgmt-appgw" -> null
          - id                          = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/cft-mtls-api-mgmt-appgw" -> null
          - name                        = "cft-mtls-api-mgmt-appgw" -> null
          - priority                    = 10 -> null
          - rule_type                   = "Basic" -> null
            # (6 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/civil-sdt-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/civil-sdt-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-http-settings" -> null
          - http_listener_id            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt" -> null
          - http_listener_name          = "civil-sdt" -> null
          - id                          = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/civil-sdt" -> null
          - name                        = "civil-sdt" -> null
          - priority                    = 30 -> null
          - rewrite_rule_set_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/civil-sdt-commissioning-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-commissioning-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-commissioning-http-settings" -> null
          - http_listener_id            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt-commissioning" -> null
          - http_listener_name          = "civil-sdt-commissioning" -> null
          - id                          = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/civil-sdt-commissioning" -> null
          - name                        = "civil-sdt-commissioning" -> null
          - priority                    = 20 -> null
          - rewrite_rule_set_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-commissioning-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/civil-sdt-address-pool"
          + backend_address_pool_name  = "civil-sdt-address-pool"
          + backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/civil-sdt-http-settings"
          + backend_http_settings_name = "civil-sdt-http-settings"
          + http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt"
          + http_listener_name         = "civil-sdt"
          + id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/civil-sdt"
          + name                       = "civil-sdt"
          + priority                   = 30
          + rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-rewriterule"
          + rewrite_rule_set_name      = "civil-sdt-rewriterule"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/civil-sdt-commissioning-address-pool"
          + backend_address_pool_name  = "civil-sdt-commissioning-address-pool"
          + backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings"
          + backend_http_settings_name = "civil-sdt-commissioning-http-settings"
          + http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt-commissioning"
          + http_listener_name         = "civil-sdt-commissioning"
          + id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/civil-sdt-commissioning"
          + name                       = "civil-sdt-commissioning"
          + priority                   = 20
          + rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule"
          + rewrite_rule_set_name      = "civil-sdt-commissioning-rewriterule"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "cft-mtls-api-mgmt-appgw-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "cft-mtls-api-mgmt-appgw-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "cft-mtls-api-mgmt-appgw"
          + id                          = (known after apply)
          + name                        = "cft-mtls-api-mgmt-appgw"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "cft-mtls-api-mgmt-appgw-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule"
          ~ name = "civil-sdt-commissioning-rewriterule" -> "cft-mtls-api-mgmt-appgw-rewriterule"

          ~ rewrite_rule {
              ~ name          = "SdtAddCustomHeadersRule" -> "AddCustomHeadersRule"
                # (1 unchanged attribute hidden)

              ~ request_header_configuration {
                  ~ header_name  = "CLIENT-IP-AGW" -> "X-ARR-ClientCertThumbprint"
                  ~ header_value = "{var_client_ip}" -> "{var_client_certificate_fingerprint}"
                }
              - request_header_configuration {
                  - header_name  = "X-ARR-ClientCertSub-AGW" -> null
                  - header_value = "{var_client_certificate_subject}" -> null
                }
              - request_header_configuration {
                  - header_name  = "URI-PATH-AGW" -> null
                  - header_value = "{var_uri_path}" -> null
                }
            }
          - rewrite_rule {
              - name          = "SdtUrlRewriteRule" -> null
              - rule_sequence = 200 -> null

              - condition {
                  - ignore_case = false -> null
                  - negate      = false -> null
                  - pattern     = ".*/producers(?>-comx)?/service/sdtapi" -> null
                  - variable    = "var_uri_path" -> null
                }

              - url {
                  - components   = "path_only" -> null
                  - path         = "/sdt-gateway" -> null
                  - reroute      = false -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-rewriterule"
          ~ name = "civil-sdt-rewriterule" -> "civil-sdt-commissioning-rewriterule"

            # (2 unchanged blocks hidden)
        }
      + rewrite_rule_set {
          + name = "civil-sdt-rewriterule"

          + rewrite_rule {
              + name          = "SdtAddCustomHeadersRule"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "CLIENT-IP-AGW"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-ARR-ClientCertSub-AGW"
                  + header_value = "{var_client_certificate_subject}"
                }
              + request_header_configuration {
                  + header_name  = "URI-PATH-AGW"
                  + header_value = "{var_uri_path}"
                }
            }
          + rewrite_rule {
              + name          = "SdtUrlRewriteRule"
              + rule_sequence = 200

              + condition {
                  + ignore_case = false
                  + negate      = false
                  + pattern     = ".*/producers(?>-comx)?/service/sdtapi"
                  + variable    = "var_uri_path"
                }

              + url {
                  + components = "path_only"
                  + path       = "/sdt-gateway"
                  + reroute    = false
                }
            }
        }

        # (31 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw|AppGw"
        name                           = "AppGw"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2153,"Program":"tfcmt","SHA1":"","Target":"test_apim_appgw","Vars":{}} -->